-- phpMyAdmin SQL Dump
-- version 4.4.15.5
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1:3306
-- Время создания: Ноя 02 2016 г., 23:34
-- Версия сервера: 5.7.11
-- Версия PHP: 7.0.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `softDb`
--

-- --------------------------------------------------------

--
-- Структура таблицы `generals`
--

CREATE TABLE IF NOT EXISTS `generals` (
  `id` bigint(20) unsigned NOT NULL,
  `name` varchar(255) NOT NULL,
  `surname` varchar(255) NOT NULL,
  `pfoto` varchar(255) DEFAULT NULL,
  `date` varchar(11) NOT NULL,
  `biography` text NOT NULL,
  `rang_id` varchar(11) DEFAULT NULL
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `generals`
--

INSERT INTO `generals` (`id`, `name`, `surname`, `pfoto`, `date`, `biography`, `rang_id`) VALUES
(1, 'Борис Васильович', 'Палій-Неїло', '1.jpg', '10-01-1878 ', 'У червні 1917 звернувся до українського представництва у Москві з проханням перевести на службу до української армії. В 1917 — учасник Першого і Другого Українських Військових З''їздів. Був обраний до складу Українського Військового Генерального Комітету на посаду помічника інспектора артилерії, невдовзі призначений командантом українських військових частин на Полтавщині та начальником міського гарнізону. З кінця грудня 1917 — начальник українізованого 1-го Тракторного артилерійського дивізіону. Навесні 1918 став організатором гарматних частин в українських корпусах. Начальник організаційного відділу управління Інспектора артилерії військ Центральної Ради, згодом — Армії Української Держави. За Гетьманату — помічник командуючого військами у Києві. Командував 6-м гарматним полком, служив у залізничній охороні Конотопсько-Бахмацького району, був помічником генерального писаря І.Полтавця-Остряниці. З жовтня 1918 — Генеральний писар Українського Козацтва. Восени 1918 підтримав Директорію УНР, організатор військового параду 22 січня 1919 у Києві на честь Злуки ЗУНР і УНР. У 1919-20 перебував на командних посадах в Армії Української Народної Республіки. 1920 брав активну участь в боях під Вінницею. 3 липня 1920 — генерал для особливих доручень при Головному Отамані С. Петлюрі, викладач артилерії у Юнацькій школі.', '2'),
(2, 'Олександр Георгійович', 'Єлчанінов', '7.jpg', '01-01-1874', 'Єлчанінов Олександр Георгійович (1874, Білорусь — 1921, м. Вадовіце, Польща) — український військовик, генерал-хорунжий Армії УНР.\r\n\r\nПід час Першої світової війни воював на Тернопільщині, комісар дивізіону артилерійської бригади 11-ї російської армії Південно-Західного фронту. Від листопада 1917 — в українській армії, згодом — інспектор кінноти Генерального штабу Армії УНР.\r\n\r\nВід весни 1920 — заступник комісара окремої кінної дивізії Івана Омеляновича-Павленка, яка в липні й вересні того ж року воювала з частинами ЧА на півдні Тернопільщини. В кінці листопада 1920 інтернований біля міста Підволочиськ.', '1'),
(3, 'Євген Спиридонович', 'Гамченко', '3.jpg', '27-06-1874', 'На військовій службі з 25 червня 1895. У 1897 закінчив Костянтинівське військове училище, отримав офіцерське звання підпоручник. Служив у 5-й артилерійській бригаді. З 12 серпня 1900 поручник, а з 1904 штабс-капітан.\r\n\r\nУ 1907 закінчив Миколаївську академію Генерального Штабу по 1-му розряду. Служив у Іркутському військовому округу. З 6 грудня 1913 підполковник. Учасник Першої світової війни, старший адьютант штабу Гродненської фортеці у 1915.\r\n\r\nУ званні полковника командир 119-го піхотного В''яземського полку з 11 грудня 1916. З 6 липня 1917 начальник штабу 3-го армійського корпусу, а з 19 жовтня цього ж року начальник штабу 27-ї піхотної дивізії. Отримав звання генерал-майор. Нагороджений орденом Святого Станіслава 2 та 3 ступенів, Святої Ганни 2 ступеня та 2 ступеня з мечами, Святого Володимира 4 ступеня.', '1'),
(4, 'Всеволод Миколайович', 'Агапієв', '4.jpg', '20-04-1877', 'Всеволод Агапієв народився 20 квітня 1877 року у Владикавказі. Походив з дворян Орловської губернії. Закінчив Михайлівський Воронізький кадетський корпус. У 1896 році закінчив Павлівське військове училище, у 1902 році — Миколаївську академію Генерального штабу за 1-м розрядом.\r\n\r\nПісля закінчення училища служив підпоручиком у 39-й артилерійській бригаді, після закінчення академії відбував 2-річний ценз командування ротою у 131-му піхотному Тираспольському полку (Київ). На посаді старшого ад''ютанта 7-ї Сибірської стрілецької дивізії брав участь у російсько-японській війні. Згодом служив на штабових посадах у штабі Київської військової округи.\r\n\r\nПід час Першої світової війни — начальник штабу 38-ї піхотної дивізії, командир 141-го піхотного Можайського полку. З липня 1916 року — генерал-майор. З 7 жовтня 1916 року — на посаді начальника штабу 124-ї піхотної дивізії. З весни 1917 року — начальник штабу Київської військової округи. Був нагороджений усіма орденами до Святого Володимира ІІІ ступеня з мечами та биндою, а також Георгіївською зброєю (12 липня 1915 року).\r\n\r\nЗ 10 травня 1918 року — член комісії з будівництва української армії та член Військово-наукового комітету при Головному управлінні Генерального штабу Української Держави. З 10 січня до 12 лютого 1919 року — помічник начальника штабу Південно-Західного фронту Дієвої армії УНР. З 12 лютого 1919 року помічник отамана Оскілка, командувача Південно-Західного району Дієвої армії УНР. З 17 лютого 1919 року — начальник штабу Північної групи Дієвої армії УНР.\r\n\r\n28-29 квітня 1919 року брав участь у повстанні командувача Північної групи отамана Оскілка проти влади Директорії, після поразки повстання втік до Польщі, де впродовж 9 місяців утримувався в камері Варшавської цитаделі. Навесні 1920 був переведений в табір Дамб''є під Краковом.[1]. Згодом емігрував. На еміграції перебував під Парижем, незабаром через хворобу переїхав до Ніцци.\r\n\r\nПомер та похований у Ніцці 22 лютого 1948 року.', '1'),
(5, 'Борис Федорович', 'Барвінський', '5.jpg', '23-10-1888', 'Народився у сім''ї священика в с. Грищинці Канівського повіту Київської губернії.\r\n\r\nЗакінчив духовну семінарію, 1-шу Київську школу прапорщиків (1915), школу ротних командирів Західного фронту (м.Вілейка, Білорусь). Під час Першої світової війни дістав контузію.\r\n\r\nУ травні 1917 в званні поручника 225-го Лівнинського піхотного полку перевівся до 1-го Українського козачого полку ім.гетьмана Богдана Хмельницького, де командував 12-ю сотнею. Штабс-капітан з червня 1917.\r\n\r\nЗ 4 січня 1918 — командир Робітничого полку Вільного Козацтва у Києві. Полк протистояв наступу червоноармійців Муравйова на Київ.\r\n\r\nЗ березня 1918 — військовий комендант Дніпровського повіту Таврійської губернії. У 2-й половині листопада 1918 — помічник губернського коменданта Київщини. З липня 1919 — помічник командира 3-го Рекрутського пішого Січового полку Дієвої армії УНР. З листопада 1919 через хворобу приватно мешкав у містечку Вчорайше (Подільська губернія). З 5 червня 1920 — помічник Миколи Чеботаріва, начальника охорони Головного отамана С.Петлюри.\r\n\r\nПісля поразки Армії УНР разом із штабом охорони Головного отамана інтернований у містечку Александрув-Куявський в Польщі. З кінця 1926 по січень 1928, коли Микола Чеботарів керував роботою секції розвідки і контррозвідки Генерального штабу УНР, Барвінський відповідав там за зв''язок з підпільними організаціями в підрадянській Україні.\r\n\r\nЗ 1928 служив контрактовим офіцером польської армії (15-й піхотний полк у м.Дембліні). Останнє звання у польській армії — підполковник (1935).\r\n\r\nУ вересні 1939 потрапив до німецького полону, був звільнений у січні 1940 за наполяганням військового міністерства УНР в екзилі. З серпня 1943 був в.о. командира 30-го полку 14-ї дивізії військ СС «Галичина» у ранзі сотника. Невдовзі був усунутий німцями з цієї посади та став командиром батальйону того ж полку. Разом із батальйоном брав участь у боях з Червоною армією під Бродами. З квітня 1945 керував 2-м полком II УД УНА.\r\n\r\nПісля закінчення Другої світової війни був заступником Михайла Крата, коменданта табору полонених у Белларії (Італія), по тому переведений до 12-го інтернаціонального табору в Ріміні. У червні 1947 українських бранців перевели до таборів у Великобританії, де вони перебували до звільнення в 1948 році.\r\n\r\nЗ 1950 жив на еміграції у США. Займався громадською роботою, належав до Союзу Бувших Українських Вояків.\r\n\r\nПохований на українському православному цвинтарі в м.Саут-Баунд-Брук (Нью-Джерсі).', '3'),
(6, 'Роман Іванович', 'Дашкевич', '6.jpg', '06-12-1892', 'Військова і громадська діяльність 1917-21 рр.[ред. • ред. код]\r\nПрацюючи з осені 1917 р. у Галицько-Буковинському Комітеті спільно з Евгеном Коновальцем, Іваном Чмолою, Г.Лисенком, Федором Черником та іншими розгорнув активну діяльність по створенню Галицько-буковинського куреня січових стрільців.\r\n\r\n18-19 грудня 1917 року відібрав у Дарницькому таборі військовополонених 22 добровольці, поклав початок формуванню стрілецької частини.\r\n\r\nСічень 1918 року обраний до складу Стрілецької Ради, з кінця лютою 1918 року призначений командиром 1-ї гарматної батареї Куреня Січових Стрільців при Січовому полку військ Центральної Ради.\r\n\r\nСічень-лютий 1918 року батарея Романа Дашкевича брала участь в запеклих боях з червоногвардійськими частинами, які рвалися до Києва, в березні 1918 р. — у визволенні міста з-під більшовицької окупації.\r\n\r\nГенерала Романа Дашкевича вважають батьком української артилерії. Роман Дашкевич першим зодягнув Січових стрільців у голубі мундири. За словами Петра Франка, голови товариства політв''язнів і репресованих:\r\n\r\n«	Дашкевич за власні кошти і за кошти своїх батьків закупив січовикам не лише мундири, а й кріси та кулемети. Ця родина добре усвідомлювала, що таке формування власної держави, і дуже дбала про вишкіл молодого покоління.[2]	 »\r\nПісля встановлення в Україні влади гетьмана Павла Скоропадського і роззброєння німецьким командуванням (30.04.1918 р.) Куреня очолював 4-ту батарею Запорізького Корпусу, який займав позиції на схід від Олександрівська (тепер Запоріжжя).\r\n\r\nЗ вересня 1918 року знову командував новосформованою батареєю Січових Стрільців; частина під командуванням Дашкевича відіграла вирішальну роль у перемозі республіканських військ у Мотовилівському бою 1918 року.\r\n\r\nСічень-грудень 1919 року — командир гарматної бригади Січових Стрільців Дієвої армії УНР, яка брала участь у всіх бойових операціях Армії УНР цього періоду.\r\n\r\nПісля поразки українських національно-визвольних змагань 1917–1921 років тимчасово перебував на еміґрації (в Чехословаччині та Австрії).\r\n\r\nЗ 1920 року повернувся до Львова.', '2'),
(7, 'Володимир Павлович', 'Савченко', '8.jpg', '03-02-1888', 'У 1917 р. вступив на прискорені курси Військової академії Генерального штабу, встиг закінчити лише старший курс (при більшовиках). Протягом 1917 p., між семестрами, обіймав посади старого ад''ютанта штабів 18-ї та 136-ї піхотних дивізій. Останнє звання у російській армії — капітан (з 22 квітня 1917 p.). Був нагороджений всіма орденами до Святого Володимира IV ступеня з мечами та биндою.\n\n26 липня 1918 р. прибув із Радянської Росії, де закінчив Академію Генерального штабу, у розпорядження Генерального штабу Української Держави. З 01 листопада 1918 р. — старший ад''ютант штабу 7-ї пішої дивізії Армії Української Держави, у складі якої перейшов на бік Директорії. У другій половині січня 1919 р. — начальник штабу групи Січових стрільців на чолі з І. Рогульським. Згодом — молодший ад''ютант штабу Східного фронту Дієвої армії УНР. З 03 березня 1919 р. — начальник залізничної частини оперативного відділу штабу Східного фронту Дієвої армії УНР. З 06 червня 1919 р. — начальник оперативної частини штабу Запорізької групи Дієвої армії УНР, т. в. о. начальника штабу 6-ї Запорізької дивізії, а з 01 листопада 1919 р. — начальник штабу 8-ї Запорізької дивізії Дієвої армії УНР.', '3');

-- --------------------------------------------------------

--
-- Структура таблицы `rangs`
--

CREATE TABLE IF NOT EXISTS `rangs` (
  `id` int(11) NOT NULL,
  `rang` varchar(255) NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=4 DEFAULT CHARSET=utf8;

--
-- Дамп данных таблицы `rangs`
--

INSERT INTO `rangs` (`id`, `rang`) VALUES
(1, 'Генерал-майор'),
(2, 'Полковник'),
(3, 'Штабс-капітан');

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `generals`
--
ALTER TABLE `generals`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `id` (`id`);

--
-- Индексы таблицы `rangs`
--
ALTER TABLE `rangs`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `generals`
--
ALTER TABLE `generals`
  MODIFY `id` bigint(20) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=8;
--
-- AUTO_INCREMENT для таблицы `rangs`
--
ALTER TABLE `rangs`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=4;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
